Revit 2027 API
GeomCombinationSet.Erase Method
Removes a specified GeomCombination from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	GeomCombination item
)
Public Overridable Function Erase (
	item As GeomCombination
) As Integer
public:
virtual int Erase(
	GeomCombination^ item
)
abstract Erase :
        item : GeomCombination -> int
override Erase :
        item : GeomCombination -> int
Parameters
item GeomCombination
The GeomCombination to be erased.
Return Value
Int32
The number of GeomCombinations that were erased from the set.
See Also
Reference
GeomCombinationSet Class
Autodesk.Revit.DB Namespace